/****************************************************\
作者信息：
姓名： 张鲡沣  学号：22281052   班级：计算机2202班   学院：计算机与信息技术学院
Email: 22281052@bjtu.edu.cn     电话：13919833035
版权声明：
    版权由北京交通大学计算机与信息技术学院2022级张鲡沣个人所有
模块名称:
    实验4 主入口函数
摘要:
    作业，配合实验4
其它说明:
    无。
模块历史:
　　张鲡沣于2023年5月5日创建本模块，email: 22281052@bjtu.edu.cn
**********************************************************/
#include "Lab4_HeaderFile.h"

/*
 *函数名称：main
 *函数功能：实现实验4全部功能,入口函数
 *输入参数：int argc：命令行参数个数、char* argv[]:命令行参数值
 *返回值：int
 *版本信息：create by Lifeng Zhang, 2023-05-05
 */
int main(int argc, char* argv[])
{
    run(argc, argv); // 调用程序主功能实现函数
    return 0;
}
