/****************************************************\
作者信息：
姓名： 张鲡沣  学号：22281052   班级：计算机2202班   学院：计算机与信息技术学院
Email: 22281052@bjtu.edu.cn     电话：13919833035
版权声明：
    版权由北京交通大学计算机与信息技术学院2022级张鲡沣个人所有
模块名称:
    实验2 主入口函数
摘要:
    作业，配合实验2
其它说明:
    无。
模块历史:
　　张鲡沣于2023年3月7日创建本模块，email: 22281052@bjtu.edu.cn
    张鲡沣于2023年3月14日修改本模块，email: 22281052@bjtu.edu.cn
    张鲡沣于2023年3月20日修改本模块，email: 22281052@bjtu.edu.cn
**********************************************************/
#include "Lab2_run.h"

/*
 *函数名称：main
 *函数功能：实现实验2全部功能
 *输入参数：int argc：命令行参数个数、char* argv[]:命令行参数值
 *返回值：int
 *版本信息：create by Lifeng Zhang, 2022-03-14
 */
int main(int argc, char* argv[])
{
    run(argc, argv); // 调用程序主功能实现函数
    return 0;
}
