/****************************************************\
作者信息：
姓名： 陈静文  学号：22281030   班级：计算机2202班   学院：计算机与信息技术学院
Email: 22281030@bjtu.edu.cn     电话：13343449636
版权声明：
    版权由北京交通大学计算机与信息技术学院2022班陈静文个人所有
模块名称:
    实验5 主入口函数
摘要:
    作业，配合实验5
其它说明:
    无。
模块历史:
　　陈静文于2023年6月1日创建本模块，email: 22281030@bjtu.edu.cn
**********************************************************/
#define _CRT_SECURE_NO_WARNINGS 1
#include"Lab5_head.h"
#include"Lab5_run.h"
/*************************************************************
函数名称:
main
功能描述:
主函数
函数参数:
无
返回值:
无
*********************************/
int main(int argc,char* argv[])
{
	run(argc, argv);
}